[
  {
    "latinName": "Zamioculcas zamifolia",
    "commonName": "ZZ Plant",
    "description": "Low-maintenance zz plants are Zamioculcas zamiifolia, characterized by their shiny, wide, oval-shaped leaves that shoot upward and quickly grow in a home indoors. The plant natively grows in East Africa, namely Zanzibar and Tanzania. The plants are also called Zanzibar gems for their spotless, waxy leaves that are so deep green that sometimes, these plants are mistaken as artificial. ZZ plants are slow-growing plants that prefer bright, indirect sunlight. One of the benefits of zz plant is that it can thrive in many lighting conditions. If you plant or repot a zz, do it in the spring or summer when it's in an active growth phase. These plants are toxic to humans and animals if ingested.",
    "pictureUrl": "https://www.thespruce.com/thmb/ps12JCvC8KyGmeQPIa9YWUCPo0M=/941x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/zz-zanzibar-gem-plant-profile-4796783-02-e80e5506091f4dcfb226c5a21718deb6.jpg",
    "minHeight": 0.4,
    "maxHeight": 0.7,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 12,
    "maxTemp": 30,
    "water": "Moderate",
    "difficulty": "Easy",
    "light": "Strong light"
  },
  {
    "latinName": "Ficus benjamina",
    "commonName": "Weeping Fig",
    "description": "Weeping fig (Ficus benjamina's common name is known as the ficus tree) grows as a large broadleaf evergreen tree in tropical and subtropical climates, but it is more often grown as a houseplant in homes, offices, and featured in interior commercial landscaping. The ficus tree is known for its longevity, living between 20 to 50 years. This elegant plant has slender branches that arch gracefully from a light gray trunk, with dense, glossy dark leaves. When the Ficus benjamina tree is grown indoors, the plants are normally pruned to keep them about 3 feet to 6 feet tall, and their trunks are sometimes braided for decorative appeal. It is a fast grower and may need to be repotted up to once per year, but do so in the early spring for best results. Weeping fig is toxic to humans and pets.",
    "pictureUrl": "https://www.thespruce.com/thmb/FkCnwYhQvE6wjH9THATcC6JcMiA=/941x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/grow-ficus-trees-1902757-1-80b8738caf8f42f28a24af94c3d4f314.jpg",
    "minHeight": 22.0,
    "maxHeight": 30.0,
    "minSpread": 10.0,
    "maxSpread": 15.0,
    "minTemp": 10,
    "maxTemp": 30,
    "water": "Moderate",
    "difficulty": "Medium",
    "light": "Full sun"
  },
  {
    "latinName": "Disocactus ackermannii",
    "commonName": "Orchid Cactus",
    "description": "This native of southern Mexico flourishes in the tropical environment. Despite the name cactus, it enjoys water. Natural growth periods are in the spring and fall only. Its scientific name has recently been changed to Disocactus ackermannii from the previous Epiphyllum ackermannii, rendering some amount of confusion in the botanical world.",
    "pictureUrl": "https://i.pinimg.com/originals/6e/1b/7c/6e1b7ca6173870fb9f1ba4bbc7409aa7.jpg",
    "minHeight": 22.0,
    "maxHeight": 30.0,
    "minSpread": 10.0,
    "maxSpread": 15.0,
    "minTemp": 10,
    "maxTemp": 30,
    "water": "Moderate",
    "difficulty": "Easy",
    "light": "Full sun"
  },
  {
    "latinName": "Dracaena marginata",
    "commonName": "Dragon tree",
    "description": " Dracaena marginata, more commonly known as a dragon tree, is an attractive plant with green sword-like, red-edged leaves. Native to Madagascar, the eye-catching spiky tree is known as a great entry plant for household gardeners—it's easy to care for, drought-tolerant, and nearly indestructible. The slow-growing plant can be planted year-round and boasts tiny white flowers in the spring (though it rarely flowers indoors). This small tree will grow to about 20 feet in warm outdoor climates, but it is generally grown as a potted houseplant and kept pruned to 6 feet or less. Keep the dragon tree away from pets because it's toxic to animals if ingested.",
    "pictureUrl": "https://www.plantvine.com/plants/Dracaena-Marginata-Cane-2.jpg",
    "minHeight": 5.0,
    "maxHeight": 7.2,
    "minSpread": 2.5,
    "maxSpread": 3.2,
    "minTemp": 10,
    "maxTemp": 30,
    "water": "Low",
    "difficulty": "Hard",
    "light": "Full sun"
  },
  {
    "latinName": "Dracaena trifasciata",
    "commonName": "Snake Plant",
    "description": "Dracaena trifasciata, commonly known as the snake plant, is one of the most popular and hardy species of houseplants. Up until 2017, it was botanically classified as Sansevieria trifasciata, but its commonalities with Dracaena species were too many to overlook. The plant features stiff, sword-like leaves and can range anywhere from six inches to eight feet tall. Snake plants can vary in color although many have green-banded leaves and commonly feature a yellow border. These plants are easy to grow and, in many cases, are nearly indestructible. They will thrive in very bright light or almost dark corners of the house. Snake plants generally grow slowly in indoor light, but increasing its exposure to light will boost growth if it receives a few hours of direct sun. Planting and repotting is best done in the spring. ",
    "pictureUrl": "https://www.thespruce.com/thmb/CpEP-cPmDmz6kwdmVKbhcrdCJuY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/snake-plant-care-overview-1902772-04-d3990a1d0e1d4202a824e929abb12fc1-349b52d646f04f31962707a703b94298.jpeg",
    "minHeight": 0.7,
    "maxHeight": 1.3,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 21,
    "maxTemp": 32,
    "water": "Low",
    "difficulty": "Easy",
    "light": "Partial sun"
  },
  {
    "latinName": "Epipremnum aureum",
    "commonName": "Golden Pothos",
    "description": "Pothos is arguably one of the easiest houseplants to grow, even if you're someone who forgets to water your plants often enough. This trailing vine, native to the Solomon Islands in the South Pacific, has pointed, heart-shaped green leaves that are sometimes variegated with white, yellow, or pale green striations. Pothos is a good indoor plant year-round and will grow quickly, often adding between 12 to 18 inches of length in a month. Be aware that pothos plants are toxic to pets.1",
    "pictureUrl": "https://www.thespruce.com/thmb/2MuMCiq0bng5SE2TbMV5p_icvok=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/KaraRileyPothos-4-64af960f3dcd445793a34ef955cb6d16.jpg",
    "minHeight": 10.0,
    "maxHeight": 15.0,
    "minSpread": 7.0,
    "maxSpread": 10.0,
    "minTemp": 16,
    "maxTemp": 25,
    "water": "Low",
    "difficulty": "Easy",
    "light": "Shade"
  },
  {
    "latinName": "Aloe vera",
    "commonName": "Healing Plant",
    "description": " Aloe vera, commonly grown as a houseplant, is known for its leaves which contain a soothing gel used on sunburns and other skin irritations. With over 300 species (the most common being Aloe barbadensis miller), this tropical succulent features fleshy lance-shape leaves with jagged edges that grow out from a basal rosette. Given the right growing conditions, spiky flowers will appear on the end of stalks in shades of yellow, red, or orange. Young plants don’t generally flower, and aloe grown as a houseplant can take years to produce flower stalks. Still, this fast-growing succulent will reach its mature size in three to four years and produces pups that can be repotted or given as gifts to other plant lovers. No green thumb is required. Consuming the leaves is toxic for people.1 The leaves are also toxic to dogs and cats.",
    "pictureUrl": "https://nextlevelgents.com/wp-content/uploads/2020/04/aloe-vera.jpg",
    "minHeight": 0.4,
    "maxHeight": 0.7,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 7,
    "maxTemp": 18,
    "water": "Low",
    "difficulty": "Medium",
    "light": "Full sun"
  },
  {
    "latinName": "Spathiphyllum cannifolium",
    "commonName": "Peace Lily",
    "description": " The peace lily is a flowering tropical plant from the Spathiphyllum genus. Outside of its hardiness zones, many people grow the peace lily indoors. There are many types of peace lily within the genus. But in general, peace lilies have large, glossy, oval leaves. They typically bloom in the spring, though that can vary when growing them as houseplants. A healthy peace lily might bloom twice a year, resulting in several months of flowers. When grown in the garden in the tropical and subtropical climates where they are hardy, peace lilies are normally planted in the spring while it is still cool. When you care for a peace lily indoors, they can be purchased and brought into the home at any time of year, though you will want to protect them from cold temperatures as you transport them. They are moderate growers and will reach maturity in around three years. Note that peace lilies are toxic to pets and people, so be mindful about where you place a peace lily in your house.",
    "pictureUrl": "https://www.mydomaine.com/thmb/bQMr16e0E469mPwh992fbAyJj70=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1566417254329_20190821-1566417255317-b9314f1d9f7a4668a466c5ffb1913a8f.jpg",
    "minHeight": 0.4,
    "maxHeight": 0.7,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 18,
    "maxTemp": 24,
    "water": "Moderate",
    "difficulty": "Easy",
    "light": "Shade"
  },
  {
    "latinName": "Ficus elastica",
    "commonName": "Rubber Plant",
    "description": "Ficus elastica, also known as the rubber plant, is an unusual-looking varietal native to the tropics of Southeast Asia. This long-lived plant boasts oversized, oval-shaped leaves with a rich emerald hue and can grow quickly, reaching up to 100 feet tall in its natural habitat. It's not the easiest plant for beginners because it's not very forgiving if it doesn't get the care it needs. However, it's more often grown indoors as a houseplant, where it can be planted and cared for year-round, and its size is kept more manageable. When it comes to caring for a rubber plant, care is straightforward. It needs adequate light, moisture, and warmth (it is a tropical plant). Give it a southern or eastern exposure, but keep it several feet away from the windows, and you'll be rewarded with an exotic addition to your indoor plant collection.",
    "pictureUrl": "https://bloomscape.com/wp-content/uploads/2022/08/bloomscape_burgundy-rubber-tree_lg_charcoal.jpg",
    "minHeight": 1.3,
    "maxHeight": 2.0,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 16,
    "maxTemp": 24,
    "water": "Moderate",
    "difficulty": "Medium",
    "light": "Partial sun"
  },
  {
    "latinName": "Aglonema Commutatum",
    "commonName": "Chinese Evergreen",
    "description": " Chinese evergreen is not a needled conifer, but rather a tropical perennial available in several cultivars that make excellent houseplants. They all have large, narrow, and glossy oval leaves on short stems, and flowers (on older plants) that bloom in spring or summer. The Chinese evergreen is one of the most popular houseplants and its color variations—from dark green and silver to red—add personality to your home's decor. Chinese evergreens are slow-growing and make excellent indoor foliage plants that can be potted and cared for year-round. Take care if you have pets because the plant is toxic to dogs and cats.",
    "pictureUrl": "https://www.gardendesign.com/pictures/images/900x705Max/site_3/chinese-evergreen-plant-aglaonema-shutterstock-com_15962.jpg",
    "minHeight": 0.7,
    "maxHeight": 1.3,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 15,
    "maxTemp": 25,
    "water": "Low",
    "difficulty": "Medium",
    "light": "Partial sun"
  },
  {
    "latinName": "Asplenium nidus",
    "commonName": "Bird's Nest Fern",
    "description": "Bird's nest ferns (Asplenium nidus) are naturally epiphytic, meaning they grow on the surface of other plants. In their rainforest homes, they can be found growing high in the crooks of trees. They form a series of erect, spoon-shaped, bright green fronds that rise from a central rosette. Healthy plants can have fronds up to 5 feet long, but bird's nest ferns kept as houseplants typically have fronds that grow only about 2 feet long. These ferns have a slow growth rate. They're best planted in the spring, though houseplants generally can be started year-round. ",
    "pictureUrl": "https://www.thespruce.com/thmb/VclH8SxoG_-WzSFz_Tv7LA6Tyv4=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/grow-asplenium-nidus-ferns-1902716-02b-0bc442544fce421a9408c321b1a51148.jpg",
    "minHeight": 1.3,
    "maxHeight": 2.0,
    "minSpread": 0.6,
    "maxSpread": 1.0,
    "minTemp": 10,
    "maxTemp": 22,
    "water": "Moderate",
    "difficulty": "Easy",
    "light": "Partial sun"
  },
  {
    "latinName": "Monstera deliciosa",
    "commonName": "Swiss cheese plant",
    "description": "Native to the rainforests of Central America, the big, bold Monstera deliciosa plant is also known as the \"split-leaf philodendron.\" This easy-to-grow climbing evergreen can be found in many designer spaces for its \"wow\" factor. Indoors, the plant has a moderate growth rate and can grow in height about 1 to 2 feet a year. Its naturally glossy large heart-shaped leaves have a characteristic split. You'll also spot intricate aerial roots growing out of the soil which benefit the plant by supporting the stems that hold leaves that can grow to 3 feet long. Plant outdoors in the right zone at any time during the year and it will also produce tannish-cream flowers pollinated by bees and edible juicy fruit with the combined flavor of pineapple and banana. However, fruiting is not common in houseplants. This beautiful plant can be toxic to pets.",
    "pictureUrl": "https://ekoaloe.cz/_obchody/go5864/soubory/css/bg.jpg",
    "minHeight": 10.0,
    "maxHeight": 15.0,
    "minSpread": 4,
    "maxSpread": 5,
    "minTemp": 10,
    "maxTemp": 18,
    "water": "Moderate",
    "difficulty": "Medium",
    "light": "Partial sun"
  },
  {
    "latinName": "Chlorophytum comosum ",
    "commonName": "Spider Plant",
    "description": "Despite their creepy-crawly name, spider plants (Chlorophytum comosum) are among the most popular houseplants to grow. When grown indoors, these warm-weather perennials will survive less-than-perfect conditions, and they are stunning if you can closely mimic their native tropical environment by providing warm temperatures and humid air. These plants grow rosettes of slender, gently arching leaves that can stretch from around 12 to 18 inches long. The leaves can be green or striped green and white. Mature plants regularly send out long stems that bear small, star-shaped flowers. If the flowers are fertilized, a small fruit forms. Once the flowers fall off, tiny plantlets form in their place, which ultimately grow their own roots and can be snipped off to create new potted plants. Spider plants are moderately fast-growing plants that can be planted at any time as long as they are not exposed to frost.",
    "pictureUrl": "https://www.bhg.com/thmb/6ACaK-OJxdX7nxNWyvhkvVZ-8mQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/BHG-spider-plant-95f4f8185c11479db04c88bd44fa82aa.jpg",
    "minHeight": 0.2,
    "maxHeight": 0.4,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 10,
    "maxTemp": 27,
    "water": "High",
    "difficulty": "Easy",
    "light": "Partial sun"
  },
  {
    "latinName": "Ficus lyrata",
    "commonName": "Fiddle Leaf",
    "description": "With huge, wavy green leaves that grow to more than a foot long, fiddle-leaf figs instantly give any room a jungle-like vibe. Lush and sculptural, this tropical plant is actually a tree capable of growing up to 50 feet tall in its jungle home. Indoors, it grows very slowly and can be kept for many years before it begins to touch the ceiling. But even if you have the space to grow it, a fiddle-leaf fig tree can be a challenging plant to live with long-term. With a well-earned reputation for being finicky, this cold-sensitive rainforest native needs just the right conditions in order to thrive indoors. It may not be the best houseplant for apartment dwellers or the horticulturally challenged, but those willing to give it the extra attention it deserves will be well-rewarded.",
    "pictureUrl": "https://www.flowerpower.com.au/media/catalog/product/cache/bdcf0022850627d2b6422c66929c11b7/1/4/145897_001.jpg",
    "minHeight": 1.0,
    "maxHeight": 6.0,
    "minSpread": 0.6,
    "maxSpread": 3.0,
    "minTemp": 10,
    "maxTemp": 30,
    "water": "Moderate",
    "difficulty": "Medium",
    "light": "Partial sun"
  },
  {
    "latinName": "Calathea rosepicta",
    "commonName": "Calathea",
    "description": "The genus Calathea—characterized by boldly marked, oblong leaves in a dazzling array of colors—includes some of the most beautiful tropical plants in the world. Due to the plants' eye-catching stripes and veining, they're often known by nicknames such as the zebra plant, peacock plant, or rattlesnake plant. Calatheas are also referred to as prayer plants, a common name that other species use as well. Calatheas can be found outside in tropical environments, and they cannot tolerate cold temperatures. So elsewhere they are typically grown indoors year-round as houseplants. Moreover, calatheas can be hard to care for, as they have a reputation for being somewhat fussy about their growing conditions. But when those conditions are met, they grow rather quickly, often reaching their mature size in a year. They are best planted in the spring.",
    "pictureUrl": "https://nurserybuy.com/wp-content/uploads/2020/11/IMG-20201030-WA0028.jpg?v=c86ee0d9d7ed",
    "minHeight": 0.2,
    "maxHeight": 0.4,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 18,
    "maxTemp": 25,
    "water": "Moderate",
    "difficulty": "Hard",
    "light": "Partial sun"
  },
  {
    "latinName": "Anthurium andraeanum",
    "commonName": "Flamingo flower",
    "description": " Anthurium is a genus of around 1,000 perennial plants native to Central America, northern South America, and the Caribbean. While they can be grown outdoors in the garden in warm climates, anthuriums are good indoor plants and are more often grown as houseplants or in greenhouses since they have particular care needs. They grow at a slow or moderate growth rate, depending on getting ample light without getting sunburned. Also called flamingo flowers for their unique tropical shape and bright red, green, and white colors, they can constantly bloom for long periods making them delightful indoor plants year-round. The blooming varieties are distinctive for their colorful, heart-shaped waxy spathes and red or yellow tail-like flower spikes. Other varieties feature large-leaved, deeply veined foliage. Many anthuriums are climbers, and all need high humidity and warmth to thrive. Anthurium typically lives about 5 years indoors with proper care but by propagating your plant, you can have a healthy anthurium indefinitely. Anthurium is toxic to humans and pets.",
    "pictureUrl": "https://plantura.garden/uk/wp-content/uploads/sites/2/2021/04/anthurium-1024x684.jpg?x96810",
    "minHeight": 0.7,
    "maxHeight": 1.3,
    "minSpread": 0.3,
    "maxSpread": 0.6,
    "minTemp": 10,
    "maxTemp": 24,
    "water": "Low",
    "difficulty": "Medium",
    "light": "Full sun"
  }
]